linux/shell/shell.org
#+LATEX_HEADER \usepackage {ctex}

* Shell
** Important commands

   | command | meaning                    | reference                            |
   |---------+----------------------------+--------------------------------------|
   | type -a | 查看命令在系统中的可用情况 |                                      |
   | fdupes  | 查找重复文件               | https://linux.cn/article-6127-1.html |
   | fslint  | 还是查找重复文件           |                                      |

** shell cmd

*** [[https://www.gnu.org/software/coreutils/manual/html_node/index.html][参考材料]]

*** 文件类型

#+BEGIN_EXAMPLE
    b - 块设备文件。
    d - 目录。
    c - 字符设备文件。
    p - 管道文件。
    l - 符号链接文件。
    f - 普通文件。
#+END_EXAMPLE

*** 通配符，批量创建

#+BEGIN_SRC sh
    touch {0..10}.txt
    touch {a..z}.txt
    touch {0,1,2}.txt
#+END_SRC

*** find
    - ~-exec 'command' {} \;~
      #+begin_src sh
	find -name "*.md" -exec more {} \;
      #+end_src

      注意 ~{}~ 与 ~\;~ 之间的空格
    - ~-mtime(modify) -ctime(create) -atime(access)~
      - 参数 ~+~ 表示在此内， ~-~ 表示在此之外
	| ~-mtime +3~ | 3天内 |
	| ~-mtime -1~ | 1天前 |
    - ~-newer~

      比哪个文件新

      用 ~!~ 来表示逻辑非
      #+begin_src sh
	find ./ ! -newer html学习.md
      #+end_src
      
    - ~-depth~

      先查找当前目录，再查找子目录

    - ~-mount~

      只查找当前文件系统，不进去其他文件系统

    - ~-ok~

      用法同-exec，但是会提示是否执行该命令

    - ~-type~

      选项见上面，常用的是
      - ~-f~ :普通文件
      - ~-d~ :目录

    - ~-max-depth 1~
      
      *应该放在其他选项之前*

      只搜索当前目录

*** xargs
    #+begin_src sh
      ls -tr1 | tail -5 | xargs -i cp {} dest/folder/
      xargs -n1 -i cp {} dest/folder
    #+end_src
    
    - 文件名包含空格

      - 仅仅使用find
	#+begin_src sh
	  find ./ -print0 |xargs -0 cp '{}' /data
        #+end_src

	文件名中包含空格的情况下使用， ~-print0~ 和 ~-0~ 配合使用，能够将带空格的文件找出来。

      - 带grep的情况
	#+begin_src sh
	  find ./ -type f | grep -v "\.git" |grep -v "code" | grep "02" | xargs -d '\n' file
        #+end_src
	使用 ~-d '\n'~ 选项指定使用回车作为参数的分割符

    - 参数在中间的情况
      #+begin_src sh
	find ./ -name "*.mp4" | xargs -i cp '{}' /data
      #+end_src

*** echo
    #+BEGIN_EXAMPLE
      \c 不换行。
      \f 进纸。
      \t 跳格。
      \n 换行。
    #+END_EXAMPLE
    - ~-e~
      转义
      #+begin_src sh
	echo -e "\"abc\" `tty`" > "abc" /dev/pts/11
      #+end_src

*** read
    - *read -p* 

      给出提示符，不显示换行
      #+begin_example
	read -p "input your name: " a
	echo $a
	 ✘ (python3.7)  ~/bin  t.sh
	input your name: abc
	abc
      #+end_example

    - *标准输入赋值到变量*
      #+begin_example
	hunch@linchuan-test3:~/test/shell$ read name
	sdfjlkavsj bn pihef awoenkjn fsdad
	hunch@linchuan-test3:~/test/shell$ echo $name
	sdfjlkavsj bn pihef awoenkjn fsdad
      #+end_example
    - *输入到数量多余变量数量，最后一个变量会收集剩余所有到值*
      #+begin_example
	hunch@linchuan-test3:~/test/shell$ read name1 name2 nameall
	aa bb cc dd ee ff gg hh
	hunch@linchuan-test3:~/test/shell$ echo $name1
	aa
	hunch@linchuan-test3:~/test/shell$ echo $name2
	bb
	hunch@linchuan-test3:~/test/shell$ echo $nameall
	cc dd ee ff gg hh
      #+end_example

    - *为变量赋缺省值*
      #+begin_src sh
	read a
	case ${a:=1} in
	    1|2) echo "you choose ${a}"
		;;
	    ,*) echo "must in [ 1 | 2 ]"
		;;
	esac
      #+end_src

    - *读取文本内容*
      *-r表示不转义解释，用raw的内容*
      
      简单的说，使用 ~-r~ 会解析 ~\~ 转义，但是当 ~\~ 在行末的时候不会将下一行连接到一起

      不使用 ~-r~ 则不会解析 ~\~ 转义，当 ~\~ 在行末的时候会将下一行连接到一起
      
      #+begin_example
	$ more 123
	asdf\asdf\asdf
	asdf\nasdf\nasdf\n
	aaaaaaaaaa\
	cccccc
	$ while read line; do echo $line; done < $a
	asdfasdfasdf
	asdfnasdfnasdfn
	aaaaaaaaaacccccc
	$ while read -r line; do echo $line; done < $a
	asdfsdfsdf
	asdf
	asdf
	asdf

	aaaaaaaaaa\
	cccccc
      #+end_example

      #+begin_src sh
	a="abc.txt"
	while read -r line; do echo $line; done < $a
      #+end_src

- *读取命令结果*\\
  #+begin_src sh
    while read -r line; do echo $line; done <<<$(ps aux | grep hunch)
    while read -r line; do echo $line; done < <(ps aux | grep hunch)
  #+end_src
*** cat
    - v
      显示控制字符
      #+begin_example
	 $ more 123
	jkkdsf
	 $ cat -v 123
	jkkdsf^F^F^F^F^F^F^F^F^F^F^F^F^F^F^F^F^F^F^F^F^F^F^F^F
      #+END_EXAMPLE

    - 编辑文件 ctrl-D结束
      #+begin_example
	hunch@linchuan-test3:~/test/shell$ cat > myfile
	asdf
	1234
	hunch@linchuan-test3:~/test/shell$ more myfile
	asdf
	1234
      #+end_example

*** tee
    输出到标准输出，同时同步一份输出到文件
    #+begin_example
      hunch@linchuan-test3:~/test/shell$ ls | tee out.file
      121.txt
      122.txt
      123.txt
      12.a.txt
      12a.txt
      myfile
      hunch@linchuan-test3:~/test/shell$ ls
      121.txt  122.txt  123.txt  12.a.txt  12a.txt  myfile  out.file
      hunch@linchuan-test3:~/test/shell$ more out.file
      121.txt
      122.txt
      123.txt
      12.a.txt
      12a.txt
      myfile
    #+end_example
    
    - vim 编辑root权限的文件
      #+begin_example
	:w !sudo tee %
      #+end_example

*** 标准输入，标准输出和错误输出
    
    | command > filename 2>&1 | 标准输出和错误输出重定向到一个文件 |
    |-------------------------+------------------------------------|
    | command 2 > filename    | 错误输出重定向到一个文件           |
    
    - ~>~ 等价于 ~1>~
    - ~2>&1~ 的含义是将错误输出重定向到标准输出

*** grep

- 通配符
  - ~*~

    匹配之前字符0次任意多次
  - ~.~
    表示任意1个字符
    
  ~*~ 和 ~.~ 通常会联合使用

  #+begin_example
    grep "dev-env.*conf" find_out
    ./docker-compose-samples/dev-env/proxy/polipo.conf
    ./docker-compose-samples/dev-env/proxy/ssh/config
  #+end_example
  这个命令的作用是查找 ~dev-env~ 后面跟着 ~conf~ 的行

- ~^~ 匹配行首
  #+begin_example
    grep "^vim" filename
    vim.md
    vim-build-from-source-mac.md
    vim2.md
    vim-build-from-source-debian.md
  #+end_example

- ~$~ 匹配行尾
  #+begin_example
    grep "sample$" filename
    commit-msg.sample
    pre-rebase.sample
    pre-commit.sample
    applypatch-msg.sample
    fsmonitor-watchman.sample
  #+end_example

- ~\{1, 3\}~ 匹配出现次数
  - ~\{1, \}~ 一次以上
  - ~\{1\}~ 刚好一次
 
  #+begin_example
    note  grep "[0-9]\{1,3\}\.[0-9]\{1,3\}\.[0-9]\{1,3\}\.[0-9]\{1,3\}" ~/.ssh/config
    HOST 121.196.213.142
    Host 192.168.1.66
    Host 40.125.172.62
    Host 139.219.10.159
  #+end_example    

