linux/shell/shell.md

# Table of Contents

1.  [Shell](#orgfcfa7dc)
    1.  [Important commands](#orgee4813d)
    2.  [shell cmd](#org27972e1)
        1.  [参考材料](#org71890c1)
        2.  [文件类型](#org575fb08)
        3.  [通配符，批量创建](#orgbdaf34d)
        4.  [find](#org6c96a58)
        5.  [xargs](#org94cb727)
        6.  [echo](#org0891688)
        7.  [read](#org952e028)
        8.  [cat](#orged4c976)
        9.  [tee](#orga2f4c60)
        10. [标准输入，标准输出和错误输出](#orgaa9b9dc)
        11. [grep](#org925b6e1)
        12. [awk](#orge116ec1)
        13. [sed](#orgce0070b)
        14. [join](#org6438fb8)
        15. [cut](#org62371d2)
        16. [rev](#org89b64b7)
        17. [sort](#orgd66b662)
        18. [ripgrep](#org97e0b74)
    3.  [shell变量和参数](#org770e479)
        1.  [变量设置时的不同模式](#orgbca71de)
        2.  [参数的引用](#orgaf899e8)
        3.  [各种引号](#org2930d3e)
        4.  [参数展开(parameter expantion)](#orga5895fb)
    4.  [条件测试](#org197e876)
        1.  [文件状态测试](#org656958c)
        2.  [组合(仅用于文件状态测试)](#org617380c)
        3.  [字符串测试](#orgb50c338)
        4.  [数值测试](#org4b252b3)
        5.  [expr](#org2c36b0a)
        6.  [<< HERE](#org3697cca)
        7.  [command substitution](#org6d37af4)
    5.  [控制流结构](#orgf7403de)
        1.  [if then else](#orgfabafed)
        2.  [case](#org07df566)
        3.  [for](#org1e03dfe)
        4.  [until](#orgff88ece)
        5.  [while](#orgd482b35)
        6.  [break](#org543e456)
        7.  [continue](#org60a58e4)
    6.  [shell函数](#orgf277236)
        1.  [load shell文件](#org5db2664)
        2.  [getopts](#org54e0483)

\#+LATEX<sub>HEADER</sub> \usepackage {ctex}


<a id="orgfcfa7dc"></a>

# Shell


<a id="orgee4813d"></a>

## Important commands

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">command</th>
<th scope="col" class="org-left">meaning</th>
<th scope="col" class="org-left">reference</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">type -a</td>
<td class="org-left">查看命令在系统中的可用情况</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">fdupes</td>
<td class="org-left">查找重复文件</td>
<td class="org-left"><https://linux.cn/article-6127-1.html></td>
</tr>


<tr>
<td class="org-left">fslint</td>
<td class="org-left">还是查找重复文件</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>


<a id="org27972e1"></a>

## shell cmd


<a id="org71890c1"></a>

### [参考材料](https://www.gnu.org/software/coreutils/manual/html_node/index.html)


<a id="org575fb08"></a>

### 文件类型

    b - 块设备文件。
    d - 目录。
    c - 字符设备文件。
    p - 管道文件。
    l - 符号链接文件。
    f - 普通文件。


<a id="orgbdaf34d"></a>

### 通配符，批量创建

    touch {0..10}.txt
    touch {a..z}.txt
    touch {0,1,2}.txt


<a id="org6c96a58"></a>

### find

-   `-exec 'command' {} \;`
    
        find -name "*.md" -exec more {} \;
    
    注意 `{}` 与 `\;` 之间的空格
-   `-mtime(modify) -ctime(create) -atime(access)`
    -   参数 `+` 表示在此内， `-` 表示在此之外
        
        <table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
        
        
        <colgroup>
        <col  class="org-left" />
        
        <col  class="org-left" />
        </colgroup>
        <tbody>
        <tr>
        <td class="org-left">`-mtime +3`</td>
        <td class="org-left">3天内</td>
        </tr>
        
        
        <tr>
        <td class="org-left">`-mtime -1`</td>
        <td class="org-left">1天前</td>
        </tr>
        </tbody>
        </table>
-   `-newer`
    
    比哪个文件新
    
    用 `!` 来表示逻辑非
    
        find ./ ! -newer html学习.md

-   `-depth`
    
    先查找当前目录，再查找子目录

-   `-mount`
    
    只查找当前文件系统，不进去其他文件系统

-   `-ok`
    
    用法同-exec，但是会提示是否执行该命令

-   `-type`
    
    选项见上面，常用的是
    
    -   `-f` :普通文件
    -   `-d` :目录

-   `-max-depth 1`
    
    **应该放在其他选项之前**
    
    只搜索当前目录


<a id="org94cb727"></a>

### xargs

    ls -tr1 | tail -5 | xargs -i cp {} dest/folder/
    xargs -n1 -i cp {} dest/folder

-   文件名包含空格
    -   仅仅使用find
        
            find ./ -print0 |xargs -0 cp '{}' /data
        
        文件名中包含空格的情况下使用， `-print0` 和 `-0` 配合使用，能够将带空格的文件找出来。
    
    -   带grep的情况
        
            find ./ -type f | grep -v "\.git" |grep -v "code" | grep "02" | xargs -d '\n' file
        
        使用 `-d '\n'` 选项指定使用回车作为参数的分割符

-   参数在中间的情况
    
        find ./ -name "*.mp4" | xargs -i cp '{}' /data
    
        find ./ -type f -name "*.mp4" | xargs -I{} cp {} video/


<a id="org0891688"></a>

### echo

    \c 不换行。
    \f 进纸。
    \t 跳格。
    \n 换行。

-   `-e`
    转义
    
        echo -e "\"abc\" `tty`" > "abc" /dev/pts/11


<a id="org952e028"></a>

### read

-   **read -p** 
    
    给出提示符，不显示换行
    
        read -p "input your name: " a
        echo $a
         ✘ (python3.7)  ~/bin  t.sh
        input your name: abc
        abc

-   **标准输入赋值到变量**
    
        hunch@linchuan-test3:~/test/shell$ read name
        sdfjlkavsj bn pihef awoenkjn fsdad
        hunch@linchuan-test3:~/test/shell$ echo $name
        sdfjlkavsj bn pihef awoenkjn fsdad
-   **输入到数量多余变量数量，最后一个变量会收集剩余所有到值**
    
        hunch@linchuan-test3:~/test/shell$ read name1 name2 nameall
        aa bb cc dd ee ff gg hh
        hunch@linchuan-test3:~/test/shell$ echo $name1
        aa
        hunch@linchuan-test3:~/test/shell$ echo $name2
        bb
        hunch@linchuan-test3:~/test/shell$ echo $nameall
        cc dd ee ff gg hh

-   **为变量赋缺省值**
    
        read a
        case ${a:=1} in
            1|2) echo "you choose ${a}"
        	;;
            *) echo "must in [ 1 | 2 ]"
        	;;
        esac

-   **读取文本内容**
    **-r表示不转义解释，用raw的内容**
    
    简单的说，使用 `-r` 会解析 `\` 转义，但是当 `\` 在行末的时候不会将下一行连接到一起
    
    不使用 `-r` 则不会解析 `\` 转义，当 `\` 在行末的时候会将下一行连接到一起
    
        $ more 123
        asdf\asdf\asdf
        asdf\nasdf\nasdf\n
        aaaaaaaaaa\
        cccccc
        $ while read line; do echo $line; done < $a
        asdfasdfasdf
        asdfnasdfnasdfn
        aaaaaaaaaacccccc
        $ while read -r line; do echo $line; done < $a
        asdfsdfsdf
        asdf
        asdf
        asdf
        
        aaaaaaaaaa\
        cccccc
    
        a="abc.txt"
        while read -r line; do echo $line; done < $a

-   **读取命令结果**  
    
        while read -r line; do echo $line; done <<<$(ps aux | grep hunch)
        while read -r line; do echo $line; done < <(ps aux | grep hunch)


<a id="orged4c976"></a>

### cat

-   v
    显示控制字符
    
         $ more 123
        jkkdsf
         $ cat -v 123
        jkkdsf^F^F^F^F^F^F^F^F^F^F^F^F^F^F^F^F^F^F^F^F^F^F^F^F

-   编辑文件 ctrl-D结束
    
        hunch@linchuan-test3:~/test/shell$ cat > myfile
        asdf
        1234
        hunch@linchuan-test3:~/test/shell$ more myfile
        asdf
        1234


<a id="orga2f4c60"></a>

### tee

输出到标准输出，同时同步一份输出到文件

    hunch@linchuan-test3:~/test/shell$ ls | tee out.file
    121.txt
    122.txt
    123.txt
    12.a.txt
    12a.txt
    myfile
    hunch@linchuan-test3:~/test/shell$ ls
    121.txt  122.txt  123.txt  12.a.txt  12a.txt  myfile  out.file
    hunch@linchuan-test3:~/test/shell$ more out.file
    121.txt
    122.txt
    123.txt
    12.a.txt
    12a.txt
    myfile

-   vim 编辑root权限的文件
    
        :w !sudo tee %


<a id="orgaa9b9dc"></a>

### 标准输入，标准输出和错误输出

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">command > filename 2>&1</th>
<th scope="col" class="org-left">标准输出和错误输出重定向到一个文件</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">command 2 > filename</td>
<td class="org-left">错误输出重定向到一个文件</td>
</tr>
</tbody>
</table>

-   `>` 等价于 `1>`
-   `2>&1` 的含义是将错误输出重定向到标准输出


<a id="org925b6e1"></a>

### grep

-   通配符
    
    -   `*`
        
        匹配之前字符0次任意多次
    -   `.`
        表示任意1个字符
    
    `*` 和 `.` 通常会联合使用
    
        grep "dev-env.*conf" find_out
        ./docker-compose-samples/dev-env/proxy/polipo.conf
        ./docker-compose-samples/dev-env/proxy/ssh/config
    
    这个命令的作用是查找 `dev-env` 后面跟着 `conf` 的行

-   `^` 匹配行首
    
        grep "^vim" filename
        vim.md
        vim-build-from-source-mac.md
        vim2.md
        vim-build-from-source-debian.md

-   `$` 匹配行尾
    
        grep "sample$" filename
        commit-msg.sample
        pre-rebase.sample
        pre-commit.sample
        applypatch-msg.sample
        fsmonitor-watchman.sample

-   `\{1, 3\}` 匹配出现次数
    
    -   `\{1, \}` 一次以上
    -   `\{1\}` 刚好一次
    
        note  grep "[0-9]\{1,3\}\.[0-9]\{1,3\}\.[0-9]\{1,3\}\.[0-9]\{1,3\}" ~/.ssh/config
        HOST 121.196.213.142
        Host 192.168.1.66
        Host 40.125.172.62
        Host 139.219.10.159
