linux/shell/shell.org
*** awk
    - ~BEGIN END~
      #+begin_example
	awk 'BEGIN {print "FILENAME\n--------------------"} {print $NF} END {print "end of report"}' find_out
      #+end_example
      #+begin_example
	awk -F/ 'BEGIN {print ARGV[1] "\n----------"} {if ($NF ~/\.org$/)print NR " " $NF} END {print "---------------\nend of report"}' find_out
      #+end_example

    - ~FILENAME~

      当前文件名
      
      *warning* FILENAME not working in BEGIN rule. 需要用上面的方式在BEGIN中打印文件名。

      [[https://www.cyberciti.biz/faq/how-to-print-filename-with-awk-on-linux-unix/][print filename]]

    - ~NR~ 

      number of record, 行号

    - ~NF~

      number of field, 域号
      
      - 打印最后一列

	#+begin_src sh
	  awk '{print $NF}'
	#+end_src

      - 打印倒数第二列
	#+begin_src sh
	  awk '{print $(NF-1)}' 
	#+end_src

    - ~-F~ *定义分割符号*
      #+begin_example
	awk -F/ '{print $NF}' find_out | grep "md$"
      #+end_example

    - 正则匹配

      ~/re/
      #+begin_example
	awk '{if ($NF ~/md$/) print $0}' find_out
	awk '{if ($0 ~/\.md$/) print $0}' find_out
	awk '{if ($6 !~/May/) print $0}' find_out
	awk '{if ($6 ~/May/) print $0}' find_out
	awk -F/ '{if ($NF ~/org$/) print $2 "/" $3}' find_out
      #+end_example
      上面的 ~!~ 表示取反操作

*** sed

    好像没什么好说的，vi中自带的就是sed操作

**** 替换行首和行尾空格
     - *行首* ~sed 's/^[ \t]*//g'~
     - *行尾* ~sed 's/[ \t]*$//g'~
     - *vim替换tab* ~%retab~:
     - *vim删除行尾空格和tab* =:%s/\s\+$//g=
     - *只删除行尾空格，不删除tab* =:%s/ *$//g=

*** TODO join
*** cut
    [[https://www.gnu.org/software/coreutils/manual/html_node/cut-invocation.html#cut-invocation][参考材料]]
    
    - ~-d~ 指定分割符
    - ~-fn~ 只保留第n个field
    - ~-fn-~ 保留从n开始及以后的所有field
    删除最后一个field:
    #+begin_example
      linc@pop-os:~/books$ echo "abc.def.hij" | rev | cut -d '.' -f2- | rev
      abc.def
    #+end_example
*** rev
    reverse输入的字符
*** sort
    
    *sort里面起始域号是1，不是0*
    
    - ~sort -u~
    
      删除所有重复行

    - ~sort -k 3~
    
      按照第三列排序

    - ~sort -kr 3~

      第三列倒序

    - ~sort -nr -k 4~

      第四列数字倒序

    - ~sort -M -k 4~
    
      第四列月份排序

    - sort的示例： 
      
      1. 第2列数字顺序，第5列数字顺序，第6列月份倒序
	 #+begin_example
	   ls -la | sort -k 2n -k 5n  -k 6Mr
	   -rw-r--r--  1 linc linc    19 Mar  4 08:36 note.org~
	   -rw-r--r--  1 linc linc    79 Mar  6 11:26 .gitignore
	   -rw-r--r--  1 linc linc   178 Mar  6 18:07 123
	   -rw-r--r--  1 linc linc   342 Mar  6 09:13 note.org
	   -rw-r--r--  1 linc linc  6749 Feb 28 17:27 my_note.ipynb
	   -rw-r--r--  1 linc linc 10113 Mar  6 18:20 find_out
	   drwxr-xr-x  2 linc linc  4096 Mar  6 09:38 latex
	   drwxr-xr-x  2 linc linc  4096 Mar  6 11:17 cloud
	   drwxr-xr-x  2 linc linc  4096 Mar  6 11:30 idea
	   drwxr-xr-x  2 linc linc  4096 Mar  6 15:55 python
	   drwxr-xr-x  2 linc linc  4096 Mar  6 16:58 temp
	   drwxr-xr-x  2 linc linc  4096 Feb 28 17:27 ffmpeg
	   drwxr-xr-x  2 linc linc  4096 Feb 28 17:27 mac
	   drwxr-xr-x  2 linc linc  4096 Feb 28 17:27 meta
	   drwxr-xr-x  2 linc linc  4096 Feb 28 17:27 vim
	   drwxr-xr-x  3 linc linc  4096 Feb 28 17:27 books
	   drwxr-xr-x  6 linc linc  4096 Feb 28 17:27 docker-compose-samples
	   drwxr-xr-x  8 linc linc  4096 Mar  7 10:29 .git
	   drwxr-xr-x 11 linc linc  4096 Mar  6 09:57 linux
	   drwxr-xr-x 15 linc linc  4096 Mar  7 10:16 .
	   drwxr-xr-x 60 linc linc  4096 Mar  7 11:26 ..
	   total 96
	 #+end_example
      2. 日期的排序
	 #+begin_example
	   4.150.156.3 - - [01/Apr/2004:06:31:51 +0000] message 1
	   211.24.3.231 - - [24/Apr/2004:20:17:39 +0000] message 2
	 #+end_example

	 对上面的文件先按照时间戳排序，再按照IP地址排序
	 #+begin_example
	   sort -s -t ' ' -k 4.9n -k 4.5M -k 4.2n -k 4.14,4.21 file*.log |
	   sort -s -t '.' -k 1,1n -k 2,2n -k 3,3n -k 4,4n
	 #+end_example
       
	 需要调用两次sort进行排序，因为IP地址是以 ~.~ 进行分割。
       
	 思路：
       
	 1) 第一个sort按照年-月-日-时间的顺序排序
	 2) 第二个sort使用 ~-t '.'~ 将 ~.~ 用作分割符分离IP地址
    
    - [[https://www.gnu.org/software/coreutils/manual/html_node/sort-invocation.html][参考资料]]

** shell变量和参数
*** 变量设置时的不同模式

    */注意：:=不能单独使用，需要在其他语句中使用，如echo，if等/*

    | 语法                 | 含义                                              |
    |----------------------+---------------------------------------------------|
    | Variable-name=value  | 设置实际值到variable-name                         |
    | Variable-name+value  | 如果设置了variable-name，则重设其值               |
    | Variable-name:?value | 如果未设置variable-name，显示未定义用户错误信息   |
    | Variable-name?value  | 如果未设置variable-name，显示系统错误信息         |
    | Variable-name:=value | 如果未设置variable-name，设置其值                 |
    | Variable-name:-value | 同上，但是取值并不设置到variable-name，可以被替换 |

*** 参数的引用
    | 参数 | 含义                                           |
    |------+------------------------------------------------|
    | $#   | 参数个数                                       |
    | $0   | 脚本名称                                       |
    | $1   | 第一个参数                                     |
    | $?   | 最后一条命令的退出状态, 0 表示正常，其他是异常 |

*** 各种引号
    - *双引号*
      除 ~$~, ~`~, ~\~ 外的其他符号
    - *单引号*
      屏蔽所有的符号
    - *反引号*
      反引号用于设置系统命令的输出到变量
    - *反斜线*
      如果下一个字符有特殊含义，反斜线防止shell误解其含义

*** 参数展开(parameter expantion)
    #+begin_example
      ${parameter:-word} # parameter为空替换为word
      ${parameter:=word} # parameter为空替换，并将值赋给$parameter变量
      bash-3.2$ unset a
      bash-3.2$ echo ${a:-1234} # a为空，输出新的值，但不对a赋值
      1234
      bash-3.2$ echo $a

      bash-3.2$ echo ${a:=1234} # a为空，输出新的值，同时对a赋值
      1234
      bash-3.2$ echo $a
      1234
      bash-3.2$ echo ${a:=abcd} # a不为空，输出a
      1234
      bash-3.2$ echo $a
      1234
      bash-3.2$ echo ${a:-abcd} # a不为空，输出a
      1234
    #+end_example

    #+begin_example
      ${parameter:?word} # parameter为空报错, 主要用于排查错误
      ${parameter:+word} # parameter不为空替换
    #+end_example

    #+begin_example
      ${#parameter}      # 获得字符串的长度
    #+end_example


    截取字符串---有了下面这四种用法就不必使用cut命令来截取字符串了。
    #+begin_src sh
      ${parameter%word}  # 最小限度从后面截取word
      ${parameter%%word} # 最大限度从后面截取word
      ${parameter#word}  # 最小限度从前面截取word
      ${parameter##word} # 最大限度从前面截取word
    #+end_src

    #+begin_example
      bash-3.2$ a=abc.txt
      bash-3.2$ echo ${a%.txt}
      abc
      bash-3.2$ echo ${a#abc}
      .txt
    #+end_example

    - 替换文件后缀名的一个方法：
      #+begin_src sh
	for i in `find ./ -name "*.list"`; do sudo mv $i ${i%.jpg}.bak; done
      #+end_src

** 条件测试
   
*** 文件状态测试

    | symbol | mean          |
    |--------+---------------|
    | -f     | 普通文件      |
    | -d     | 目录          |
    | -r     | 可读          |
    | -x     | 可执行        |
    | -s     | 文件长度大于0 |

*** 组合(仅用于文件状态测试)
    - *-a逻辑与*
    - *-o逻辑或*

    示例：
    #+begin_example
      [ -f abc.sh -a -x abc.sh ]
    #+end_example

    abc.sh存在且可执行, *注意括号两端的空格*

*** 字符串测试
    #+begin_example
      [ string operator string ]
      [ operator string ]
    #+end_example
    | operator | mean             |
    |----------+------------------|
    | =        | 两个字符串相等。 |
    | !=       | 两个字符串不等。 |
    | -z       | 空串。           |
    | -n       | 非空串。         |

