linux/shell/shell.md


<a id="orge116ec1"></a>

### awk

-   `BEGIN END`
    
        awk 'BEGIN {print "FILENAME\n--------------------"} {print $NF} END {print "end of report"}' find_out
    
        awk -F/ 'BEGIN {print ARGV[1] "\n----------"} {if ($NF ~/\.org$/)print NR " " $NF} END {print "---------------\nend of report"}' find_out

-   `FILENAME`
    
    当前文件名
    
    **warning** FILENAME not working in BEGIN rule. 需要用上面的方式在BEGIN中打印文件名。
    
    [print filename](https://www.cyberciti.biz/faq/how-to-print-filename-with-awk-on-linux-unix/)

-   `NR` 
    
    number of record, 行号

-   `NF`
    
    number of field, 域号
    
    -   打印最后一列
        
            awk '{print $NF}'
    
    -   打印倒数第二列
        
            awk '{print $(NF-1)}'

-   `-F` **定义分割符号**
    
        awk -F/ '{print $NF}' find_out | grep "md$"

-   正则匹配
    
    ~/re/
    
        awk '{if ($NF ~/md$/) print $0}' find_out
        awk '{if ($0 ~/\.md$/) print $0}' find_out
        awk '{if ($6 !~/May/) print $0}' find_out
        awk '{if ($6 ~/May/) print $0}' find_out
        awk -F/ '{if ($NF ~/org$/) print $2 "/" $3}' find_out
    
    上面的 `!` 表示取反操作


<a id="orgce0070b"></a>

### sed

好像没什么好说的，vi中自带的就是sed操作

1.  替换行首和行尾空格

    -   **行首** `sed 's/^[ \t]*//g'`
    -   **行尾** `sed 's/[ \t]*$//g'`
    -   **vim替换tab** `%retab`:
    -   **vim删除行尾空格和tab** `:%s/\s\+$//g`
    -   **只删除行尾空格，不删除tab** `:%s/ *$//g`


<a id="org6438fb8"></a>

### TODO join


<a id="org62371d2"></a>

### cut

[参考材料](https://www.gnu.org/software/coreutils/manual/html_node/cut-invocation.html#cut-invocation)

-   `-d` 指定分割符
-   `-fn` 只保留第n个field
-   `-fn-` 保留从n开始及以后的所有field

删除最后一个field:

    linc@pop-os:~/books$ echo "abc.def.hij" | rev | cut -d '.' -f2- | rev
    abc.def


<a id="org89b64b7"></a>

### rev

reverse输入的字符


<a id="orgd66b662"></a>

### sort

**sort里面起始域号是1，不是0**

-   `sort -u`
    
    删除所有重复行

-   `sort -k 3`
    
    按照第三列排序

-   `sort -kr 3`
    
    第三列倒序

-   `sort -nr -k 4`
    
    第四列数字倒序

-   `sort -M -k 4`
    
    第四列月份排序

-   sort的示例： 
    1.  第2列数字顺序，第5列数字顺序，第6列月份倒序
        
            ls -la | sort -k 2n -k 5n  -k 6Mr
            -rw-r--r--  1 linc linc    19 Mar  4 08:36 note.org~
            -rw-r--r--  1 linc linc    79 Mar  6 11:26 .gitignore
            -rw-r--r--  1 linc linc   178 Mar  6 18:07 123
            -rw-r--r--  1 linc linc   342 Mar  6 09:13 note.org
            -rw-r--r--  1 linc linc  6749 Feb 28 17:27 my_note.ipynb
            -rw-r--r--  1 linc linc 10113 Mar  6 18:20 find_out
            drwxr-xr-x  2 linc linc  4096 Mar  6 09:38 latex
            drwxr-xr-x  2 linc linc  4096 Mar  6 11:17 cloud
            drwxr-xr-x  2 linc linc  4096 Mar  6 11:30 idea
            drwxr-xr-x  2 linc linc  4096 Mar  6 15:55 python
            drwxr-xr-x  2 linc linc  4096 Mar  6 16:58 temp
            drwxr-xr-x  2 linc linc  4096 Feb 28 17:27 ffmpeg
            drwxr-xr-x  2 linc linc  4096 Feb 28 17:27 mac
            drwxr-xr-x  2 linc linc  4096 Feb 28 17:27 meta
            drwxr-xr-x  2 linc linc  4096 Feb 28 17:27 vim
            drwxr-xr-x  3 linc linc  4096 Feb 28 17:27 books
            drwxr-xr-x  6 linc linc  4096 Feb 28 17:27 docker-compose-samples
            drwxr-xr-x  8 linc linc  4096 Mar  7 10:29 .git
            drwxr-xr-x 11 linc linc  4096 Mar  6 09:57 linux
            drwxr-xr-x 15 linc linc  4096 Mar  7 10:16 .
            drwxr-xr-x 60 linc linc  4096 Mar  7 11:26 ..
            total 96
    2.  日期的排序
        
            4.150.156.3 - - [01/Apr/2004:06:31:51 +0000] message 1
            211.24.3.231 - - [24/Apr/2004:20:17:39 +0000] message 2
        
        对上面的文件先按照时间戳排序，再按照IP地址排序
        
            sort -s -t ' ' -k 4.9n -k 4.5M -k 4.2n -k 4.14,4.21 file*.log |
            sort -s -t '.' -k 1,1n -k 2,2n -k 3,3n -k 4,4n
        
        需要调用两次sort进行排序，因为IP地址是以 `.` 进行分割。
        
        思路：
        
        1.  第一个sort按照年-月-日-时间的顺序排序
        2.  第二个sort使用 `-t '.'` 将 `.` 用作分割符分离IP地址

-   [参考资料](https://www.gnu.org/software/coreutils/manual/html_node/sort-invocation.html)


<a id="org97e0b74"></a>

### ripgrep

1.  安装

    [github地址](https://github.com/BurntSushi/ripgrep/)

2.  指定文件类型进行搜索（后缀名）

        rg -torg png
    
    在.org文件中搜索png字符串


<a id="org770e479"></a>

## shell变量和参数


<a id="orgbca71de"></a>

### 变量设置时的不同模式

***注意：:=不能单独使用，需要在其他语句中使用，如echo，if等***

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">语法</th>
<th scope="col" class="org-left">含义</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">Variable-name=value</td>
<td class="org-left">设置实际值到variable-name</td>
</tr>


<tr>
<td class="org-left">Variable-name+value</td>
<td class="org-left">如果设置了variable-name，则重设其值</td>
</tr>


<tr>
<td class="org-left">Variable-name:?value</td>
<td class="org-left">如果未设置variable-name，显示未定义用户错误信息</td>
</tr>


<tr>
<td class="org-left">Variable-name?value</td>
<td class="org-left">如果未设置variable-name，显示系统错误信息</td>
</tr>


<tr>
<td class="org-left">Variable-name:=value</td>
<td class="org-left">如果未设置variable-name，设置其值</td>
</tr>


<tr>
<td class="org-left">Variable-name:-value</td>
<td class="org-left">同上，但是取值并不设置到variable-name，可以被替换</td>
</tr>
</tbody>
</table>


<a id="orgaf899e8"></a>

### 参数的引用

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">参数</th>
<th scope="col" class="org-left">含义</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">$#</td>
<td class="org-left">参数个数</td>
</tr>


<tr>
<td class="org-left">$0</td>
<td class="org-left">脚本名称</td>
</tr>


<tr>
<td class="org-left">$1</td>
<td class="org-left">第一个参数</td>
</tr>


<tr>
<td class="org-left">$?</td>
<td class="org-left">最后一条命令的退出状态, 0 表示正常，其他是异常</td>
</tr>
</tbody>
</table>


<a id="org2930d3e"></a>

### 各种引号

-   **双引号**
    除 `$`, `` ` ``, `\` 外的其他符号
-   **单引号**
    屏蔽所有的符号
-   **反引号**
    反引号用于设置系统命令的输出到变量
-   **反斜线**
    如果下一个字符有特殊含义，反斜线防止shell误解其含义


<a id="orga5895fb"></a>

### 参数展开(parameter expantion)

    ${parameter:-word} # parameter为空替换为word
    ${parameter:=word} # parameter为空替换，并将值赋给$parameter变量
    bash-3.2$ unset a
    bash-3.2$ echo ${a:-1234} # a为空，输出新的值，但不对a赋值
    1234
    bash-3.2$ echo $a
    
    bash-3.2$ echo ${a:=1234} # a为空，输出新的值，同时对a赋值
    1234
    bash-3.2$ echo $a
    1234
    bash-3.2$ echo ${a:=abcd} # a不为空，输出a
    1234
    bash-3.2$ echo $a
    1234
    bash-3.2$ echo ${a:-abcd} # a不为空，输出a
    1234

    ${parameter:?word} # parameter为空报错, 主要用于排查错误
    ${parameter:+word} # parameter不为空替换

    ${#parameter}      # 获得字符串的长度

截取字符串&#x2014;有了下面这四种用法就不必使用cut命令来截取字符串了。

    ${parameter%word}  # 最小限度从后面截取word
    ${parameter%%word} # 最大限度从后面截取word
    ${parameter#word}  # 最小限度从前面截取word
    ${parameter##word} # 最大限度从前面截取word

    bash-3.2$ a=abc.txt
    bash-3.2$ echo ${a%.txt}
    abc
    bash-3.2$ echo ${a#abc}
    .txt

-   替换文件后缀名的一个方法：
    
        for i in `find ./ -name "*.list"`; do sudo mv $i ${i%.jpg}.bak; done


<a id="org197e876"></a>

## 条件测试


<a id="org656958c"></a>

### 文件状态测试

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">symbol</th>
<th scope="col" class="org-left">mean</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">-f</td>
<td class="org-left">普通文件</td>
</tr>


<tr>
<td class="org-left">-d</td>
<td class="org-left">目录</td>
</tr>


<tr>
<td class="org-left">-r</td>
<td class="org-left">可读</td>
</tr>


<tr>
<td class="org-left">-x</td>
<td class="org-left">可执行</td>
</tr>


<tr>
<td class="org-left">-s</td>
<td class="org-left">文件长度大于0</td>
</tr>
</tbody>
</table>


<a id="org617380c"></a>

### 组合(仅用于文件状态测试)

-   **-a逻辑与**
-   **-o逻辑或**

示例：

    [ -f abc.sh -a -x abc.sh ]

abc.sh存在且可执行, **注意括号两端的空格**


<a id="orgb50c338"></a>

### 字符串测试

    [ string operator string ]
    [ operator string ]

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">operator</th>
<th scope="col" class="org-left">mean</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">=</td>
<td class="org-left">两个字符串相等。</td>
</tr>


<tr>
<td class="org-left">!=</td>
<td class="org-left">两个字符串不等。</td>
</tr>


<tr>
<td class="org-left">-z</td>
<td class="org-left">空串。</td>
</tr>


<tr>
<td class="org-left">-n</td>
<td class="org-left">非空串。</td>
</tr>
</tbody>
</table>
