linux/shell/shell.org
*** 数值测试
    #+begin_example
      [ "number" numeric_operator "number" ]
    #+end_example

    | operator | mean                       |
    |----------+----------------------------|
    | -eq      | 数值相等。                 |
    | -ne      | 数值不相等。               |
    | -gt      | 第一个数大于第二个数。     |
    | -lt      | 第一个数小于第二个数。     |
    | -le      | 第一个数小于等于第二个数。 |
    | -ge      | 第一个数大于等于第二个数。 |

*** expr
    用于数值计算
    #+begin_example
      expr argument operator argument
    #+end_example
    #+begin_example
    $ expr 3 + 4
    7
    #+end_example

*** << HERE

    表示一段输入
    #+begin_example
      linc@pop-os:~/note$ while read -r line; do echo $line; done << eof
      > asdf
      > bbb
      > ccc
      > eof
      asdf
      bbb
      ccc
    #+end_example

**** read from var
     #+begin_example
       a="abc def ghi"
       cat <<< $a
     #+end_example
     
**** read from file
     #+begin_example
       a="abc.txt"\\
       cat < $a
     #+end_example

**** read from command output
     #+begin_example
       cat < <(command)\\
       cat <<< $(command)
     #+end_example

**** read from stand input
     #+BEGIN_SRC sh
       $ grep "^a" <&0
       xxx
       abc
       abc
       jjj
     #+END_SRC
     #+begin_example
       linc@pop-os:~/note$ grep "^a" <&0
       ccc
       ddd
       abc
       abc
       aaaaaaaaaaaaaa
       aaaaaaaaaaaaaa
     #+end_example

**** write file with multi-line
     #+BEGIN_SRC sh
       cat > abc.txt <<eof
       abc
       $a
       end
       eof
     #+END_SRC

*** TODO command substitution
** 控制流结构

*** if then else
    
    #+BEGIN_SRC sh
      if [ $# -lt "1" ]; then
	  echo "need at lest one param"
      else
	  echo "the params are $@"
      fi
    #+END_SRC

    -变异

    #+BEGIN_SRC sh
      [ -f abc.txt ] && a="True" || a="False"
    #+END_SRC

*** case
    
    #+BEGIN_SRC sh
      if ! [ $# -eq "1" ]; then
	  echo "need just 1 param"
      else
	  case $1 in
	      1) echo "you input 1"
		  ;;
	      2) echo "you input 2"
		  ;;
	      ,*) echo "must input 1 or 2" >&2
		  exit 1
		  ;;
	  esac
      fi
    #+END_SRC

*** for
    
    #+BEGIN_SRC sh
      for filex in ./*; do
	  echo $filex
      done
    #+END_SRC

*** until

    #+BEGIN_SRC sh
      read a
      until [ $a -eq 100 ]; do
	  read a
      done
    #+END_SRC

*** while
    
    - *读入文件*
      #+begin_src sh
	# 从第一个参数的文件读入每一行
	while read line; do
	    echo $line
	done < $1
      #+end_src

*** break
    
    #+BEGIN_SRC sh
      # break的使用
      while :; do
	  echo "input number in [1..5]"
	  read input
	  case $input in
	      1|2|3|4|5) echo "you are right"
		  ;;
	      ,*) echo "you are wrong"
		  break
		  ;;
	  esac
      done
    #+END_SRC

*** continue

    #+BEGIN_SRC sh
      # continue的使用
      echo "input number in [1..5]"
      while :; do
	  read input
	  if [ $input -le 5 -a $input -ge 1 ]; then
	      echo "you are right"
	      continue
	  fi
	  exit 0
      done
    #+END_SRC

** shell函数
   
   #+BEGIN_SRC sh
     function findit() {
	 if [ $# -lt 1 ]; then
	     echo "usage: findit file"
	     return 1
	 fi
	 find / -name $1 -print
     }
   #+END_SRC

   #+BEGIN_EXAMPLE
	(python3.7)  ~/bin  . functions.main
	(python3.7)  ~/bin  findit
       usage: findit file
   #+END_EXAMPLE

*** load shell文件
    *使用. file-path来加载shell文件，之后可以直接使用其中定义的函数*

    #+BEGIN_SRC sh
      bash-3.2$ find
      find           find2perl      find2perl5.18  findhyph       findrule       findrule5.18
      bash-3.2$ ls
      __pycache__                     functions.main                  phantomjs-2.1.1-macosx.zip
      compose.py                      img_view.py                     rec.py
      format_boost.py                 index.sh                        sox
      front_rsa                       phantomjs                       t.sh
      front_rsa.pub                   phantomjs-2.1.1-macosx          test.sh
      bash-3.2$ . functions.main
      bash-3.2$ find
      find           find2perl5.18  findit         findrule5.18
      find2perl      findhyph       findrule
      bash-3.2$ findit
      usage: findit file
      bash-3.2$ more functions.main
      #!/usr/bin/env sh

      function findit() {
	  if [ $# -lt 1 ]; then
	      echo "usage: findit file"
	      return 1
	  fi
	  find / -name $1 -print
      }
      bash-3.2$ unset findit
      bash-3.2$ find
      find           find2perl      find2perl5.18  findhyph       findrule       findrule5.18
    #+END_SRC

*** getopts

    - 解析命令行参数的函数
      #+begin_src sh
	function parse_cmd() {
	    ALL=false
	    HELP=false
	    VERBOSE=false
	    function usage() {
		echo "`basename $0` -[a h v] -c value -f file" 1>&2
	    }
	    while getopts ":ahvf:c:" OPTION; do
		case $OPTION in
		    a)ALL=true
			;;
		    h)HELP=true
			;;
		    f)FILE=$OPTARG
			;;
		    v)VERBOSE=true
			;;
		    c)COPIES=$OPTARG
			;;
		    \?) # usage statemant
			usage
			;;
		    :) # missing params
			echo "`basename $0`: option \"-$OPTARG\" missing value" 1>&2
			return 1
			;;
		esac
	    done

	    if [ -z $FILE ] || [ -z $COPIES ]; then
		echo "`basename $0` missing options -f -c"
		usage
		return 1
	    fi
	}
      #+end_src

    - 调用该函数
  
    #+begin_src sh
      parse_cmd $@

      case $? in
	  1) echo "something wrong"
	      ;;
	  0) echo "seems ok"
	      echo ALL is $ALL
	      echo VERBOSE is $VERBOSE
	      echo HELP is $HELP
	      echo FILE is $FILE
	      echo COPIES is $COPIES
	      ;;
      esac
    #+end_src
