linux/shell/shell.md


<a id="org4b252b3"></a>

### 数值测试

    [ "number" numeric_operator "number" ]

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">operator</th>
<th scope="col" class="org-left">mean</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">-eq</td>
<td class="org-left">数值相等。</td>
</tr>


<tr>
<td class="org-left">-ne</td>
<td class="org-left">数值不相等。</td>
</tr>


<tr>
<td class="org-left">-gt</td>
<td class="org-left">第一个数大于第二个数。</td>
</tr>


<tr>
<td class="org-left">-lt</td>
<td class="org-left">第一个数小于第二个数。</td>
</tr>


<tr>
<td class="org-left">-le</td>
<td class="org-left">第一个数小于等于第二个数。</td>
</tr>


<tr>
<td class="org-left">-ge</td>
<td class="org-left">第一个数大于等于第二个数。</td>
</tr>
</tbody>
</table>


<a id="org2c36b0a"></a>

### expr

用于数值计算

    expr argument operator argument

    $ expr 3 + 4
    7


<a id="org3697cca"></a>

### << HERE

表示一段输入

    linc@pop-os:~/note$ while read -r line; do echo $line; done << eof
    > asdf
    > bbb
    > ccc
    > eof
    asdf
    bbb
    ccc

1.  read from var

        a="abc def ghi"
        cat <<< $a

2.  read from file

        a="abc.txt"\\
        cat < $a

3.  read from command output

        cat < <(command)\\
        cat <<< $(command)

4.  read from stand input

        $ grep "^a" <&0
        xxx
        abc
        abc
        jjj
    
        linc@pop-os:~/note$ grep "^a" <&0
        ccc
        ddd
        abc
        abc
        aaaaaaaaaaaaaa
        aaaaaaaaaaaaaa

5.  write file with multi-line

        cat > abc.txt <<eof
        abc
        $a
        end
        eof


<a id="org6d37af4"></a>

### TODO command substitution


<a id="orgf7403de"></a>

## 控制流结构


<a id="orgfabafed"></a>

### if then else

    if [ $# -lt "1" ]; then
        echo "need at lest one param"
    else
        echo "the params are $@"
    fi

-变异

    [ -f abc.txt ] && a="True" || a="False"


<a id="org07df566"></a>

### case

    if ! [ $# -eq "1" ]; then
        echo "need just 1 param"
    else
        case $1 in
    	1) echo "you input 1"
    	    ;;
    	2) echo "you input 2"
    	    ;;
    	*) echo "must input 1 or 2" >&2
    	    exit 1
    	    ;;
        esac
    fi


<a id="org1e03dfe"></a>

### for

    for filex in ./*; do
        echo $filex
    done


<a id="orgff88ece"></a>

### until

    read a
    until [ $a -eq 100 ]; do
        read a
    done


<a id="orgd482b35"></a>

### while

-   **读入文件**
    
        # 从第一个参数的文件读入每一行
        while read line; do
            echo $line
        done < $1


<a id="org543e456"></a>

### break

    # break的使用
    while :; do
        echo "input number in [1..5]"
        read input
        case $input in
    	1|2|3|4|5) echo "you are right"
    	    ;;
    	*) echo "you are wrong"
    	    break
    	    ;;
        esac
    done


<a id="org60a58e4"></a>

### continue

    # continue的使用
    echo "input number in [1..5]"
    while :; do
        read input
        if [ $input -le 5 -a $input -ge 1 ]; then
    	echo "you are right"
    	continue
        fi
        exit 0
    done


<a id="orgf277236"></a>

## shell函数

    function findit() {
        if [ $# -lt 1 ]; then
    	echo "usage: findit file"
    	return 1
        fi
        find / -name $1 -print
    }

     (python3.7)  ~/bin  . functions.main
     (python3.7)  ~/bin  findit
    usage: findit file


<a id="org5db2664"></a>

### load shell文件

**使用. file-path来加载shell文件，之后可以直接使用其中定义的函数**

    bash-3.2$ find
    find           find2perl      find2perl5.18  findhyph       findrule       findrule5.18
    bash-3.2$ ls
    __pycache__                     functions.main                  phantomjs-2.1.1-macosx.zip
    compose.py                      img_view.py                     rec.py
    format_boost.py                 index.sh                        sox
    front_rsa                       phantomjs                       t.sh
    front_rsa.pub                   phantomjs-2.1.1-macosx          test.sh
    bash-3.2$ . functions.main
    bash-3.2$ find
    find           find2perl5.18  findit         findrule5.18
    find2perl      findhyph       findrule
    bash-3.2$ findit
    usage: findit file
    bash-3.2$ more functions.main
    #!/usr/bin/env sh
    
    function findit() {
        if [ $# -lt 1 ]; then
    	echo "usage: findit file"
    	return 1
        fi
        find / -name $1 -print
    }
    bash-3.2$ unset findit
    bash-3.2$ find
    find           find2perl      find2perl5.18  findhyph       findrule       findrule5.18


<a id="org54e0483"></a>

### getopts

-   解析命令行参数的函数
    
        function parse_cmd() {
            ALL=false
            HELP=false
            VERBOSE=false
            function usage() {
        	echo "`basename $0` -[a h v] -c value -f file" 1>&2
            }
            while getopts ":ahvf:c:" OPTION; do
        	case $OPTION in
        	    a)ALL=true
        		;;
        	    h)HELP=true
        		;;
        	    f)FILE=$OPTARG
        		;;
        	    v)VERBOSE=true
        		;;
        	    c)COPIES=$OPTARG
        		;;
        	    \?) # usage statemant
        		usage
        		;;
        	    :) # missing params
        		echo "`basename $0`: option \"-$OPTARG\" missing value" 1>&2
        		return 1
        		;;
        	esac
            done
        
            if [ -z $FILE ] || [ -z $COPIES ]; then
        	echo "`basename $0` missing options -f -c"
        	usage
        	return 1
            fi
        }

-   调用该函数

    parse_cmd $@
    
    case $? in
        1) echo "something wrong"
    	;;
        0) echo "seems ok"
    	echo ALL is $ALL
    	echo VERBOSE is $VERBOSE
    	echo HELP is $HELP
    	echo FILE is $FILE
    	echo COPIES is $COPIES
    	;;
    esac

